request();
var jsonStr = '[{"id":"5c4664116e36eb0123329849","title":"回家懒得洗澡，往沙...","text":"回家懒得洗澡，往沙发上一躺，就听老婆温柔地说：“过来，我帮你洗澡哦！”我受宠若惊，跑过去，却见我家的狗狗已经先过去了，老婆温柔地抱起它，温柔地把它放进浴池，温柔地替它搓洗……我仰天长叹……‍‍‍‍","type":1,"ct":"2019-01-2208: 30: 09.000"},{"id":"5c465d066e36eb01233293a9","title":"早起的你，是因为马桶...","text":"早起的你，是因为马桶的追求，还是因为被窝的不挽留？","type":1,"ct":"2019-01-2208: 00: 06.823"},{"id":"5c4655fd6e36eb01233290fe","title":"关于养狗后还能不能独...","text":"关于养狗后还能不能独自吃东西的问题，国外有网友进行了深度测试：凌晨，蹑手蹑脚进厨房摊个鸡蛋小煎饼，摸黑躲到车库，不开灯，轻轻咬一口。。","type":1,"ct":"2019-01-2207: 30: 05.768"},{"id":"5c464ef66e36eb0123328d2d","title":"有些人生就像喝水，“...","text":"有些人生就像喝水，“孤～独～孤～独～”的，一杯子就没了。。","type":1,"ct":"2019-01-2207: 00: 06.061"},{"id":"5c4640e66e36eb01233288d6","title":"紫薇丢失的那一集，尔...","text":"紫薇丢失的那一集，尔康是在妓院找到她的。紫薇永远不会问，那天尔康为什么会去妓院。","type":1,"ct":"2019-01-2206: 00: 06.848"},{"id":"5c4558e06e36eb01233240e6","title":"一朋友，卖水果的，...","text":"一朋友，卖水果的，他说卖了十几年了都没挣到什么钱，但是一直不愿转行，原因是：我的水果摊位桌子都很低，每天大量美女低头挑水果是我坚持下去的动力！","type":1,"ct":"2019-01-2113: 30: 08.291"},{"id":"5c454acf6e36eb0123323c97","title":"在网上看到用盐水泡脚...","text":"在网上看到用盐水泡脚，可以强身健体，放了两勺盐到足浴盆里，舀了一口尝尝觉得淡了，于是又加了几勺，直到咸淡正好。","type":1,"ct":"2019-01-2112: 30: 07.101"},{"id":"5c4544db6e36eb01233239b1","title":"本人男，痔疮犯了，买...","text":"本人男，痔疮犯了，买个一盒痔疮栓，现在这药都越来越人性化了，为了防止涂完药后弄脏内裤，盒里还给带了一包卫生护垫，今天也是有史以来第一次带护垫，可能由于走路摩擦将护垫弄掉了，沿着裤腿落在了办公室的地上，恰巧被旁边的女同事看见了……看来我是说不清楚了","type":1,"ct":"2019-01-2112: 04: 43.058"},{"id":"5c4544db6e36eb01233239af","title":"随着婴儿一声啼哭，美...","text":"随着婴儿一声啼哭，美女护士推开产房的门走了出来。我迫不及待的迎上去问她：情况怎么样？护士说：还好啊，母子平安！我继续问她：那能让我抱一抱，亲一亲吗？美女护士说：可以啊，但是要轻一点啊！于是我抱起护士，轻轻的亲了她一下。","type":1,"ct":"2019-01-2112: 04: 43.006"},{"id":"5c4544db6e36eb01233239ae","title":"那天和人事部的同事聊...","text":"那天和人事部的同事聊天，说当初那么多人应聘怎么就聘用我了呢，含含糊糊说了半天，最后明白了，人事经理觉得我长得像招财猫。","type":1,"ct":"2019-01-2112: 04: 43.005"},{"id":"5c4535b86e36eb012332335b","title":"一蜜蜂问花说：“你用...","text":"一蜜蜂问花说：“你用我的铅笔了吗？”花说：“我没用。”蜜蜂说：“真没用？”花说：“我真没用。”蜜蜂说：“你是第十七个承认自己没用的”","type":1,"ct":"2019-01-2111: 00: 08.046"},{"id":"5c4535b86e36eb012332335a","title":"伊拉克战争期间最流行...","text":"伊拉克战争期间最流行的三个词：和平peace、战争war、发现found把这三个英文单词连起来大声读三遍，你会揭开一个重大历史谜团：屁是我放的","type":1,"ct":"2019-01-2111: 00: 08.043"},{"id":"5c4535b76e36eb0123323359","text":"儿子挑食，吃饭什么都没胃口，吃不了多少。<br/>昨天公司聚餐，我带着他一起去，那家饭店的饭做得特别好特别软和特别香，从来吃饭要哔着吃的儿子，吃了四碗！<br/>于是，我在众目睽睽之下追着饭店服务员问着米从哪里买未果的情况下，打包了一盆他们饭店的白饭拿回家……","title":"挑食的儿子","type":1,"ct":"2019-01-2111: 00: 07.399"},{"id":"5c4527a86e36eb0123322a83","title":"各位女生洗澡的时候请...","text":"各位女生洗澡的时候请注意了，当你在浴室洗澡的时候千万别闭上眼睛。因为你一闭上眼睛，“浴鬼”就会盯着你看，你一睁开眼，他就消失了。唯一能让你看到他的办法就是拿DV录制下来，但是你千万不能看这DV！！因为它已经被封印到DV里了，然后你需要把DV带子寄给老衲。老衲会帮你施法，把浴鬼驱除，让你免受浴鬼侵扰。虽然老衲会因此伤点元气，但佛曰：我不入地狱谁入地狱！阿弥陀佛。","type":1,"ct":"2019-01-2110: 00: 08.478"},{"id":"5c45209f6e36eb0123322515","title":"高三那年，王超刚开始...","text":"高三那年，王超刚开始初恋就被父亲发现了，他批评王超：“你也太不上进了，我像你这么大的时候，孩子都有了。”","type":1,"ct":"2019-01-2109: 30: 07.760"},{"id":"5c451abc6e36eb012332222c","title":"有天悟空直接问唐僧：...","text":"有天悟空直接问唐僧：“师父，你动不动就开除我，为什么从没想过要开除八戒和沙僧？”面对悟空的质问，唐僧看了看他的另外两个徒儿，轻声说：“因为为师是佛门中人。”“这跟佛门有什么关系？”“佛门中人是不能乱开沙戒的。”“………”","type":1,"ct":"2019-01-2109: 05: 00.249"},{"id":"5c451abc6e36eb012332222b","title":"我妈说我小时候很有礼...","text":"我妈说我小时候很有礼貌，见到大人就扑通的下跪。","type":1,"ct":"2019-01-2109: 05: 00.241"},{"id":"5c45128e6e36eb012331fb6e","title":"“说一件恋人做过最让...","text":"“说一件恋人做过最让你感动的事吧。”“和我玩捉迷藏，玩了二十多年来了也没找到我。”","type":1,"ct":"2019-01-2108: 30: 06.076"},{"id":"5c450b8c6e36eb012331f8a8","title":"妹妹跟我说：姐姐，咱...","text":"妹妹跟我说：姐姐，咱们房间里总是有嗡嗡的声音，这大冬天的怎么还有蚊子呢？我：你确定那是蚊子？妹妹：？？？我：哦，没事....","type":1,"ct":"2019-01-2108: 00: 12.512"},{"id":"5c45047d6e36eb012331f6b5","title":"“心太软的人，肩膀一...","text":"“心太软的人，肩膀一般都比较硬。”“为什么？”“因为他要把所有问题都自己扛！”","type":1,"ct":"2019-01-2107: 30: 05.963"}]';
var contentList = JSON.parse(jsonStr);
console.log(contentList)
function request () {
  var that = this;
  var id = '859213';
  var sign = 'c6f3cc004db440cdadbce5bdf1f45233';
  wx.request({
    url: 'http://route.showapi.com/341-1',
    data: {
      showapi_appid: id,
      showapi_sign: sign
    },
    success: function (e) {
      if (e.data.showapi_res_body.ret_code == 0){
        console.log(e.data.showapi_res_body.contentlist)
        var list = e.data.showapi_res_body.contentlist;
        wx.setStorageSync('list', list)
    }else{
        console.warn('请求异常')
        wx.removeStorage({
          key: 'list',
          success(res) {
            console.log('移除List缓存')
          }
        });
        var list = contentList;
        wx.setStorageSync('list', list)
    }
      
    },
    fail: function () {
      console.warn('请求失败')
      wx.removeStorage({
        key: 'list',
        success(res) {
          console.log('移除List缓存')
        }
      });
      var list = contentList;
      wx.setStorageSync('list', list)
    }
  });
}

module.exports = {
  request :request
}


       